IRP/src/Enums/CashAccountTypes/CashAccountTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CashAccountTypes</name>
 <enumValues>
  <name>Bank</name>
 </enumValues>
 <enumValues>
  <name>Cash</name>
 </enumValues>
 <enumValues>
  <name>Transit</name>
 </enumValues>
 <enumValues>
  <name>POS</name>
 </enumValues>
 <enumValues>
  <name>POSCashAccount</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/CashAccounts/CashAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CashAccounts</name>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.CashAccountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>BankName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransitAccount</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Branch</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>CommissionIsSeparate</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiptingAccount</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>IntegrationSetting</name>
    <type>
      <types>CatalogRef.IntegrationSettings</types>
    </type>
  </attributes>
  <attributes>
    <name>CashAccount</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>FinancialMovementType</name>
    <type>
      <types>CatalogRef.ExpenseAndRevenueTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Acquiring</name>
    <type>
      <types>CatalogRef.Hardware</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/CatCashAccountsServer/Module.bsl
Procedure OnCreateAtServer(Cancel, StandardProcessing, Form, Parameters) Export
	If Parameters.Property("FormTitle") Then
		Form.Title = Parameters.FormTitle;
		Form.AutoTitle = False;
	EndIf;
EndProcedure

Function GetCashAccountInfo(CashAccount) Export
	Return Catalogs.CashAccounts.GetCashAccountInfo(CashAccount);
EndFunction

Procedure RemoveUnusedAccountTypes(Form, FormAttributeName) Export
	ArrayForDelete = New Array();
	
	If Not FOServer.IsUseBankDocuments() Then
		For Each ListItem In Form.Items[FormAttributeName].ChoiceList Do
			
			If Not ValueIsFilled(ListItem.Value) 
				Or ListItem.Value = Enums.CashAccountTypes.Cash
				Or ListItem.Value = Enums.CashAccountTypes.POS 
				Or ListItem.Value = Enums.CashAccountTypes.POSCashAccount Then
				Continue;
			EndIf;
			
			ArrayForDelete.Add(ListItem);
			
		EndDo;
	EndIf;
	
	If Not FOServer.IsUseConsolidatedRetailSales() Then
		For Each ListItem In Form.Items[FormAttributeName].ChoiceList Do
			If ListItem.Value = Enums.CashAccountTypes.POSCashAccount Then
				ArrayForDelete.Add(ListItem);
			EndIf;
		EndDo;
	EndIf;
	
	For Each ArrayItem In ArrayForDelete Do
		Form.Items[FormAttributeName].ChoiceList.Delete(ArrayItem);
	EndDo;	
EndProcedure
